public/man/man1/btmgmt.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - btmgmt.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - btmgmt.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>btmgmt - interactive bluetooth management tool</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>btmgmt</strong> [–options] [commands]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>btmgmt(1)</strong> interactive bluetooth management tool. The tool issues
commands to the Kernel using the Bluetooth Management socket, some
commands may require net-admin capability in order to work since the
Bluetooth Management interface is considered a low-level interface meant
for the likes of <strong>bluetoothd(8)</strong>, it is not recommended for applications
to use it directly as it may result in unexpected behavior.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<blockquote>
<dl>
<dt>
<strong>-i/–index</strong>
</dt>
<dd>Specify adapter index</dd>
<dt>
<strong>-m-/-monitor</strong>
</dt>
<dd>Enable monitor output</dd>
<dt>
<strong>-t/–timeout</strong>
</dt>
<dd>Timeout in seconds for non-interactive mode</dd>
<dt>
<strong>-v/–version</strong>
</dt>
<dd>Display version</dd>
<dt>
<strong>-i/–init-script</strong>
</dt>
<dd>Init script file</dd>
<dt>
<strong>-h/–help</strong>
</dt>
<dd>Display help</dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
COMMANDS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<blockquote>
<dl>
<dt>
<strong>main</strong>
</dt>
<dd>See <strong>bluetoothctl-mgmt(1)</strong></dd>
<dt>
<strong>monitor</strong>
</dt>
<dd>See <strong>bluetoothctl-monitor(1)</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
AUTOMATION
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Two common ways to automate the tool are to pass the commands directly
like in the follow example:</p>
<blockquote>
<blockquote>
<pre class="example">
btmgmt &lt;&lt;EOF
list
show
EOF
</pre>
</blockquote>
</blockquote>
<p>
Or create a script and pass it as init-script:</p>
<blockquote>
<blockquote>
<pre class="example">
$ vi test-script.bt
list
show
quit
:wq
$ btmgmt --init-script=test-script
</pre>
</blockquote>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
RESOURCES
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>&lt;http://www.bluez.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
REPORTING BUGS
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>&lt;linux-bluetooth@vger.kernel.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
COPYRIGHT
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>Free use of this software is granted under ther terms of the GNU Lesser
General Public Licenses (LGPL).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
